//: # Курс "Swift-Drift" от [SnapBlog](http://snapblog.ru)
//:
//: ## Цели обучения
//:
//: В конце этого урока вы научитесь:
//:
//: * Различать константы и переменные
//:
//: * Понимать, когда использовать явное и неявное объявления типа
//:
//: * Узнаете преимущества использования опциональных типов (optionals) и optional binding
//:
//: * Различать опциональные типы (optionals) и неявно развернутые опциональные типы (implicitly unwrapped optionals)
//:
//: * Работа с условными операторами и циклами
//:
//: * Различать функции, методы и инициализаторы
//:
//: * Различать классы, структуры и перечисления
//:
//: * Понимать синтаксис для наследования и протокола соответствия (protocol conformance)
//:
//: * Определить неявные типы и найти дополнительную информацию с помощью Xcode's quick help shortcut
//:
//: * Добавлять в проект и использовать фреймворк UIKit
//:
//: * ...и многое другое
//:
//: [Далее](@next)
//:
//: [SnapBlog](http://snapblog.ru)